{
    "Updateversion" :  1.0 ,

    "UpdateLink" : "https://pub-c1204d2b24cf465f97103caf439f2784.r2.dev/ARM.2024.1080p.HDTS.Hindi-Line.ESub.x264.Vegamovies.to.mkv",

    "Boolen" : true,

    "disclaimer" : " This application is intended solely for educational purposes. We do not support, promote, or condone piracy in any form. All content within this application is provided with respect to the copyright laws and regulations. Users are encouraged to use the information responsibly and in accordance with legal standards. Any unauthorized use of the content, including but not limited to, distribution of copyrighted material without permission, is strictly prohibited.",

    "Bollywood" :[
            {
                "moviename":" A.R.M (2024) Hindi HQ-HDTS ",
                "review" : "A.R.M (2024)  captivates with its seamless fusion of cutting-edge technology and human emotion, creating an enthralling cinematic experience. The plot revolves around a dystopian future where augmented reality machines (ARMs) shape the way society functions. The film's standout feature is its breathtaking visual effects, which bring the futuristic world to life with stunning realism. The narrative delves into the ethical dilemmas and emotional complexities that arise from this advanced technology, providing depth to the sci-fi genre. The performances are commendable, with the lead actors delivering emotionally charged portrayals that resonate with the audience. The film's pacing is well-balanced, maintaining suspense and intrigue throughout. However, some may find the storyline slightly predictable, with a few familiar tropes. Overall, A.R.M (2024) is a thought-provoking and visually spectacular film that explores the intersection of technology and humanity, making it a must-watch for sci-fi enthusiasts. Have you seen it? What’s your take?",
                "moviethumb" : "https://i.pinimg.com/564x/e0/b0/b7/e0b0b7b22d6f0595f8dcefa49ec3891a.jpg",
                "Screenshots" : [
                    "https://imgbb.top/ib/hVsCbpm2k0u1x8i_1726269742.jpg"

                    ,"https://imgbb.top/ib/ZIzHU1yH1rf4GEW_1726269743.jpg",

                    "https://imgbb.top/ib/OhFckROFKB10RND_1726269743.jpg",
                    "https://imgbb.top/ib/eK358sCdh1qz99D_1726269743.jpg",
                    "https://imgbb.top/ib/ReIjhFHaRRrFJOZ_1726269742.jpg"],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/ARM.2024.480p.HDTS.Hindi-Line.ESub.x264.Vegamovies.to.mkv",
                "720p" : "https://f2.fastdl.lol/ARM.2024.720p.HDTS.Hindi-Line.ESub.x264.Vegamovies.to.mkv",
            "1080p" : "https://pub-c1204d2b24cf465f97103caf439f2784.r2.dev/ARM.2024.1080p.HDTS.Hindi-Line.ESub.x264.Vegamovies.to.mkv"}
                
            },
            {
                "moviename":"Stree 2: Sarkate Ka Aatank (2024) AMZN WEB-DL",
                 "review" : "Stree 2 delivers a riveting continuation to the original's blend of horror and humor, masterfully playing with societal themes and folklore. The narrative follows our favorite quirky characters as they confront new supernatural challenges in their small town. The film retains its signature wit, combining jump scares with laugh-out-loud moments. The script is tighter, the scares more refined, and the humor smarter. The performances, especially by Rajkummar Rao and Shraddha Kapoor, are top-notch, adding depth to the otherwise fantastical plot. The cinematography and visual effects have seen a marked improvement, making the eerie atmosphere more immersive. However, a few predictable plot twists could dampen the experience for seasoned horror aficionados. Overall, Stree 2 successfully captures the essence of its predecessor while bringing fresh elements to the table, ensuring an engaging watch for fans of the genre. A delightful mix of scares and laughter, perfect for a spooky night in. What did you think of it?",

                "moviethumb" : "https://i.pinimg.com/564x/70/02/9e/70029e8c30677fd8bf6326cd109f4f66.jpg",
                "Screenshots" : [
                    "https://imgbb.top/ib/UZYHKP2O8wFRmhp_1727291624.jpg"

                    ,"https://imgbb.top/ib/zT3iLVG23RH55Be_1727291624.jpg",

                    "https://imgbb.top/ib/TQSWuq6DHzd9pyW_1727291625.jpg",
                    "https://imgbb.top/ib/PX0WsCSJw1sRBvr_1727291624.jpg",
                    "https://imgbb.top/ib/ZBKjGAaVsNktpcW_1727291626.jpg",
                     "https://imgbb.top/ib/UZYHKP2O8wFRmhp_1727291624.jpg"

                    ,"https://imgbb.top/ib/zT3iLVG23RH55Be_1727291624.jpg",

                    "https://imgbb.top/ib/TQSWuq6DHzd9pyW_1727291625.jpg",
                    "https://imgbb.top/ib/PX0WsCSJw1sRBvr_1727291624.jpg",
                    "https://imgbb.top/ib/ZBKjGAaVsNktpcW_1727291626.jpg"
                    ],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/Stree.2-Sarkate.Ka.Aatank.2024.480p.Hindi.WEB-DL.ESub.x264.Vegamovies.is.mkv",
                "720p" : "https://f2.fastdl.lol/Stree.2-Sarkate.Ka.Aatank.2024.720p.HEVC.Hindi.WEB-DL.5.1.ESub.x265.Vegamovies.is.mkv",
            "1080p" : "https://f2.fastdl.lol/Stree.2-Sarkate.Ka.Aatank.2024.1080p.Hindi.WEB-DL.5.1.ESub.x264.Vegamovies.is.mkv"}
                
            },
            {
                "moviename":" Sector 36 (2024) WEB-DL",
                 "review" : "Sector 36  emerges as a gripping thriller that masterfully intertwines mystery, action, and drama. Set against the backdrop of a bustling urban district, the film delves into the murky depths of crime and corruption. The storyline is taut and fast-paced, keeping viewers on the edge of their seats with its unpredictable twists and turns. The lead actors deliver stellar performances, infusing their characters with depth and complexity. The direction is sharp, with meticulous attention to detail that brings the gritty setting to life. The cinematography is noteworthy, capturing the raw essence of the urban landscape. However, some might find the narrative a tad convoluted with its myriad subplots. Despite this, Sector 36  stands out for its compelling narrative and strong performances, making it a must-watch for fans of intense, thought-provoking cinema. It’s a journey through the dark alleys of humanity that lingers long after the credits roll. What’s your take on it?",
                "moviethumb" : "https://i.pinimg.com/564x/61/e3/7c/61e37c18dd8ba9cfbd15d24bc2fbfe5c.jpg",
                "Screenshots" : [
                   "https://imgbb.top/ib/Et3Nh2iVcyhRVtR_1726213610.jpg",
                   "https://imgbb.top/ib/np3rneT0FNdG9xz_1726213610.jpg","https://imgbb.top/ib/gm4WPu47gzy4UoJ_1726213610.jpg",
                   "https://imgbb.top/ib/juYAVujYzJy6feT_1726213610.jpg"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/Sector.36.2024.Hindi.HD.480P.Vegamovies.To.mkv",
                "720p" : "https://f2.fastdl.lol/Sector.36.2024.Hindi.HD.720P.Vegamovies.To.mkv",
            "1080p" : "https://pub-a54cf05626744ccb9fdfd191205421d6.r2.dev/Sector.36.2024.Hindi.HD.1080P.Vegamovies.To.mkv"}
                
            },

            {
                "moviename":"Thalavan (2024)",
                 "review" : "Thalavan (2024)  is a high-octane cinematic experience that balances action, drama, and emotion with finesse. The film revolves around an intrepid leader, portrayed with unmatched charisma by its lead actor. The screenplay is tightly woven, keeping the audience engrossed with a series of riveting twists and powerful dialogues. The director's vision is vividly brought to life through stunning cinematography and top-notch special effects, making each scene a visual treat. The supporting cast delivers commendable performances, adding depth and dimension to the narrative. The film's soundtrack, with its pulsating beats and poignant melodies, enhances the storytelling, resonating deeply with the audience. While some may find the plot slightly predictable, the execution more than makes up for it. Thalavan is a must-watch for fans of the genre, offering a perfect blend of adrenaline-pumping action and heartfelt moments. It’s a testament to the spirit of leadership and resilience. Have you caught it yet?",
                "moviethumb" : "https://i.pinimg.com/736x/90/6a/24/906a24a0955615c03a63187781e4bf17.jpg",
                "Screenshots" : [
                   "https://imgbb.top/ib/90BBmJfwQIFuzDJ_1725909839.jpg",
                   "https://imgbb.top/ib/8lxfnYVsNxTYAlv_1725909839.jpg",
                   "https://imgbb.top/ib/xwBjoUqknNk3MSQ_1725909839.jpg",
                   "https://imgbb.top/ib/AansXztnQFHc8DR_1725909839.jpg",
                   "https://imgbb.top/ib/tcvHd9k48C92i4h_1725909839.jpg"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/Thalavan.2024.480p.DS4K.WEB-DL.Hindi-Malayalam.ESub.x264-Vegamovies.to.mkv",
                "720p" : "https://f2.fastdl.lol/Thalavan.2024.720p.10Bit.DS4K.WEB-DL.Hindi.5.1-Malayalam.HEVC.x265-Vegamovies.to.mkv",
            "1080p" : "https://pub-0e669a44fc704557b3eb944e73b05fec.r2.dev/Thalavan.2024.WebRip.1080p.Hindi.Malayalam.DD.5.1.x264.ESub.Vegamovies.to.mkv"}
                
            },
            {
                "moviename":"Ulajh (2024) Netflix WEB-DL",
                 "review" : "Ulajh (2024) weaves a captivating tale of intrigue and human emotion, set against a richly detailed backdrop. The film explores the complexities of relationships and the ripple effects of secrets coming to light. The director skillfully balances drama and suspense, keeping audiences engrossed throughout. The lead actors deliver powerhouse performances, breathing life into their multidimensional characters. The cinematography is stunning, capturing both the grand vistas and intimate moments with equal finesse. The screenplay is well-crafted, with sharp dialogues and a narrative that flows seamlessly. However, some viewers might find the pacing a bit uneven in parts. The film’s music score adds depth to the storytelling, accentuating the emotional beats perfectly. Overall, Ulajh is a thought-provoking and visually beautiful film that delves into the intricacies of human connections. It's a must-watch for those who appreciate nuanced storytelling and strong character-driven plots. What stood out to you the most?",
                "moviethumb" : "https://i.pinimg.com/564x/cd/4b/cc/cd4bcc907f71b9ad87645c6444d3f06e.jpg",
                "Screenshots" : [
                   "https://imgbb.top/ib/RI2WliI9198f4V8_1727378247.jpg",
                   "https://imgbb.top/ib/43uRnIZvCAwHaG3_1727378247.jpg",
                   "https://imgbb.top/ib/Rs90mYovr6eGFkO_1727378247.jpg",
                   "https://imgbb.top/ib/HkiiLdEmdz7fwU4_1727378247.jpg"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/Ulajh.2024.Hindi.WEB-DL.480p.x264.ESub.Vegamovies.is.mkv",
                "720p" : "https://f2.fastdl.lol/Ulajh.2024.Hindi.WEB-DL.720p.x264.DDP5.1-192Kbps.ESub.Vegamovies.is.mkv",
            "1080p" : "https://f2.fastdl.lol/Ulajh.2024.Hindi.WEB-DL.1080p.x264.DDP5.1-640Kbps.ESub.Vegamovies.is.mkv"}
                
            },
            {
                "moviename":"Saripodhaa Sanivaaram (2024)",
                 "review" : "Saripodhaa Sanivaaram (2024) is an exhilarating rollercoaster of emotions, set against a vibrant tapestry of culture and tradition. The film masterfully blends high-stakes drama with heartwarming moments, making for a captivating watch. The story revolves around the intertwining lives of its richly developed characters, each bringing their unique flavor to the narrative. The lead actors deliver powerful performances, drawing the audience into their world with authenticity and depth. The direction is both dynamic and nuanced, ensuring that each scene leaves an impact. The cinematography is visually stunning, capturing the essence of every locale with breathtaking beauty. The soundtrack complements the film perfectly, heightening the emotional resonance of key scenes. While the plot occasionally treads familiar ground, it does so with such finesse that it remains engaging throughout. Saripodhaa Sanivaaram is a celebration of life and relationships, sure to leave audiences reflecting long after the credits roll. What did you think of it?",
                "moviethumb" : "https://i.pinimg.com/736x/4d/79/8c/4d798c24c309a90e85c0fbb009b291c4.jpg",
                "Screenshots" : [
                   "https://imgbb.top/ib/S8k65eaCICYhATa_1727302370.jpg",
                   "https://imgbb.top/ib/q4q5sE089BrGZuO_1727302370.jpg",
                   "https://imgbb.top/ib/nbRq7bjOIRCP6Ll_1727302370.jpg",
                   "https://imgbb.top/ib/Ty61i7NZwNt0hkZ_1727302370.jpg",
                   "https://imgbb.top/ib/u87cnJu67jMUjJM_1727302370.jpg"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/Saripodhaa.Sanivaaram.2024.480p.WEB-DL.Hindi-Telugu.ESub.x264.Vegamovies.is.mkv",
                "720p" : "https://f2.fastdl.lol/Saripodhaa.Sanivaaram.2024.720p.WEB-DL.Hindi.5.1-Telugu.5.1.ESub.x264.Vegamovies.is.mkv",
            "1080p" : "https://f2.fastdl.lol/Saripodhaa.Sanivaaram.2024.1080p.HEVC.WEB-DL.Hindi.5.1-Telugu.5.1.ESub.x265.Vegamovies.is.mkv"}
                
            },
            {
                "moviename":"Tumbbad (2018)",
                 "review" : "Tumbbad (2018) is a mesmerizing blend of horror, fantasy, and folklore, offering an atmospheric and thought-provoking cinematic experience. The film's narrative revolves around a mysterious village and a hidden treasure, exploring themes of greed, mythology, and human nature. Sohum Shah delivers a compelling performance as the protagonist, embodying the character's obsession and desperation with chilling authenticity. The film's visual storytelling is exceptional, with stunning cinematography that captures the eerie and haunting beauty of Tumbbad's landscapes. The use of practical effects and minimal CGI adds to the film's raw and immersive feel. The screenplay is tightly woven, keeping audiences on the edge of their seats with its twists and revelations. However, some viewers might find the pacing a bit slow in parts. Overall, Tumbbad  is a unique and captivating film that pushes the boundaries of Indian cinema, leaving a lasting impression long after the credits roll. What’s your take on it? ",
                "moviethumb" : "https://i.pinimg.com/564x/2a/e6/03/2ae60375900aff3dbd3fa7bba793f2bf.jpg",
                "Screenshots" : [
                   "https://i.imgur.com/gV7m6Ll.png",
                   "https://i.imgur.com/Xwbu98E.png",
                   "https://i.imgur.com/JegyKXU.png",
                   "https://i.imgur.com/yVZtFxD.png"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/Tumbbad.2018.480p.Hindi.WEB-DL.ESub.x264.Vegamovies.to.mkv",
                "720p" : "https://f2.fastdl.lol/Tumbbad.2018.720p.Hindi.WEB-DL.5.1.ESub.x264.Vegamovies.to.mkv",
            "1080p" : "https://pub-06b548c4799143a2ab9be17cac629d25.r2.dev/Tumbbad.2018.1080p.Hindi.WEB-DL.5.1.ESub.x264.Vegamovies.to.mkv"}
                
            },
            {
                "moviename":"Munjya (2024)",
                 "review" : "Munjya (2024)  enthralls with its compelling storyline and richly drawn characters. The film delves into the intricate dynamics of a tightly-knit community facing unforeseen challenges. The narrative is poignant, blending elements of drama and suspense seamlessly. The lead actors deliver powerhouse performances, particularly in scenes that demand emotional depth. The cinematography captures the essence of the setting, painting a vivid backdrop for the unfolding drama. The screenplay is well-crafted, keeping viewers engaged with its twists and turns. The musical score complements the storytelling, adding layers to the narrative’s emotional impact. However, some may find the pacing uneven in parts. Overall, Munjya is a thought-provoking film that offers a deep dive into the complexities of human relationships and societal norms. It’s a cinematic journey that stays with you, reflecting on the delicate balance between tradition and modernity. Have you seen it? What did you think? ",
                "moviethumb" : "https://i.pinimg.com/736x/37/7f/2a/377f2ad43672561e22514fa2a1d0d915.jpg",
                "Screenshots" : [
                   "https://imgbb.top/ib/hWd74mkVifQisDV_1724526091.jpg",
                   "https://imgbb.top/ib/0IeAm2Pv8qWdGz9_1724526091.jpg",
                   "https://imgbb.top/ib/EMAIG9j67KIKoHz_1724526092.jpg",
                   "https://imgbb.top/ib/nWTfArr1711eJCr_1724526091.jpg",
                   "https://imgbb.top/ib/CxL6GkGcApMpqya_1724526092.jpg"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://late-smoke-9e64.sokec559974956.workers.dev/1396623963/c541b6e1a4cd1755c7d9ca06e53829fc9429abd42a8fa5ddafb187a1115780597f1841117fd98de8137370b803cae148fa827ed37c3f1f5308d11fc39e2270f684e752ad258e8c6c4b5e0fd6a5e61686c1f723617756412488825298e9a92ac26bdc499f077c03bcfe2c89ad31688d96::df42072af6af160b762f3053ab129a3f/Munjya.2024.Hindi.HS.WEB-DL.480p.x264.Vegamovies.to.mkv",
                "720p" : "https://pixeldra.in/api/file/oH4HxCNK?download",
            "1080p" : "https://pixeldra.in/api/file/6ReENW3K?download"}
                
            },
            {
                "moviename":"Aavesham (2024) DSNP WEB-DL",
                 "review" : "Aavesham (2024)  strikes a compelling balance between high-octane action and deep emotional narratives. The film centers around a protagonist driven by vengeance, but what sets it apart is the nuanced exploration of his psyche. The lead actor's performance is intense and layered, drawing viewers into his journey with every scene. The cinematography is striking, capturing the raw beauty and gritty realism of the settings. The screenplay is sharp, weaving complex subplots into a cohesive narrative that keeps the audience engaged. The action sequences are choreographed with precision, delivering thrills without overshadowing the story. However, the film occasionally leans on familiar tropes, which might feel predictable to some. The soundtrack elevates the emotional weight of the film, perfectly complementing the highs and lows of the narrative. Overall, Aavesham  is a gripping watch that combines visceral action with a thoughtful examination of revenge and redemption. What's your take on it?",
                "moviethumb" : "https://i.pinimg.com/736x/3f/ff/d7/3fffd702d48852ede79ed71d04f36a2b.jpg",
                "Screenshots" : [
                   "https://imgbb.top/ib/BBghIEnSHLxZqku_1719522430.png",
                   "https://imgbb.top/ib/jzct3zZeK10Hnr4_1719522430.png",
                   "https://imgbb.top/ib/0qvhIPvd0ClOUrA_1719522430.png",
                   "https://imgbb.top/ib/pYrPbVYo0sQVOk1_1719522430.png",
                   "https://imgbb.top/ib/Mdj0HYjk8DtZ3F5_1719522430.png"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://pixeldra.in/api/file/FeK7ucdD?download",
                "720p" : "https://pixeldra.in/api/file/q7gmaB7y?download",
            "1080p" : "https://pixeldra.in/api/file/WC353Rzp?download"}
                
            },
            {
                "moviename":"The Greatest of All Time (2024) WEB-DL",
                 "review" : "The Greatest of All Time (2024) is a cinematic triumph, seamlessly blending inspiration and drama to create a compelling narrative. The film chronicles the journey of a young athlete, rising from obscurity to global acclaim. The lead actor's performance is nothing short of stellar, capturing the emotional highs and lows with authenticity. The screenplay is well-crafted, weaving in moments of tension and triumph that keep the audience engaged. The direction is sharp, with each scene meticulously crafted to drive the story forward. The cinematography stands out, with stunning visuals that enhance the film’s emotional impact. The soundtrack complements the narrative perfectly, elevating key moments with its evocative melodies. While the film treads familiar ground, it does so with such finesse that it feels fresh and engaging. Overall, The Greatest of All Time is a must-watch, offering a poignant exploration of perseverance, ambition, and the human spirit. Have you seen it yet? What did you think?",
                "moviethumb" : "https://i.pinimg.com/736x/ec/68/4e/ec684e80b8fe884eb05f932c6e3c26d9.jpg",
                "Screenshots" : [
                   "https://imgbb.top/ib/Ob7CQuWJFbtZiGl_1727433265.jpg",
                   "https://imgbb.top/ib/RK2dNav2wR6pyLz_1727433265.jpg",
                   "https://imgbb.top/ib/Vf2Qw3UKtmiavAp_1727433265.jpg"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/G.O.A.T-Greatest.Of.All.Times.2024.480p.WEBRip.Hindi.Line.HC.ESub.x264.Vegamovies.is%20-%201XBET.mkv",
                "720p" : "https://f2.fastdl.lol/G.O.A.T-Greatest.Of.All.Times.2024.720p.WEBRip.Hindi.Line.HC.ESub.x264.Vegamovies.is%20-%201XBET.mkv",
            "1080p" : "https://f2.fastdl.lol/G.O.A.T-Greatest.Of.All.Times.2024.1080p.WEBRip.Hindi.Line.HC.ESub.x264.Vegamovies.is%20-%201XBET.mkv"}
                
            }
            



    ]

,





    "Hollywood" :[
    
        {
                "moviename":"National Treasure: Book of Secrets (2007)",
                 "review" : "National Treasure: Book of Secrets (2007) is an exhilarating ride through history and adventure, featuring Nicolas Cage reprising his role as the intrepid treasure hunter, Benjamin Gates. The sequel ups the ante with more complex puzzles and higher stakes, as Gates seeks to clear his family's name by uncovering hidden truths behind Abraham Lincoln's assassination. The film's strength lies in its fast-paced plot, blending historical facts with engaging fiction. The ensemble cast, including Diane Kruger and Helen Mirren, delivers solid performances, adding depth and charisma to the story. The cinematography captures stunning locations, enhancing the sense of a global treasure hunt. While some elements may feel formulaic, the film's charm and sense of adventure keep it entertaining. National Treasure: Book of Secrets  is a fun, family-friendly adventure that delivers thrills, intrigue, and a healthy dose of historical fiction. What did you think of it?",
                "moviethumb" : "https://vegamovies.fans/wp-content/uploads/2020/07/National-Treasure-165x248.jpg",
                "Screenshots" : [
                    "https://imgbb.top/ib/hVsCbpm2k0u1x8i_1726269742.jpg"

                    ,"https://imgbb.top/ib/ZIzHU1yH1rf4GEW_1726269743.jpg",

                    "https://imgbb.top/ib/OhFckROFKB10RND_1726269743.jpg",
                    "https://imgbb.top/ib/eK358sCdh1qz99D_1726269743.jpg",
                    "https://imgbb.top/ib/ReIjhFHaRRrFJOZ_1726269742.jpg"],

                "Downloadlinks" : {"480p" : "https://pub-c7303b37c6934ec294d2cc98e9bc3125.r2.dev/The.Penguin.S01E01.480p.WEB-DL.HIN-ENG.x264.ESub.Vegamovies.is.mkv",
                "720p" : "https://f2.fastdl.lol/The.Penguin.S01E01.720p.WEB-DL.HIN-ENG.x264.ESub.Vegamovies.is.mkv",
            "1080p" : "https://pub-2ddca0f6489e44e69819e6417ce8c80a.r2.dev/The.Penguin.S01E01.1080p.WEB-DL.HIN-ENG.x264.ESub.Vegamovies.is.mkv"}
                
            },
            {
                "moviename":" Inside Out 2",
                 "review" : "Inside Out 2 beautifully continues the emotional journey started by its predecessor, diving deeper into the intricacies of the human mind. This sequel once again showcases Pixar's knack for combining heartfelt storytelling with stunning animation. The narrative follows Riley as she navigates the tumultuous waters of adolescence, introducing new emotions that enrich the already complex landscape of her mind. The returning voice cast delivers exceptional performances, breathing life into their characters with charm and authenticity. The film's exploration of themes like identity, change, and resilience is both thought-provoking and relatable, resonating with audiences of all ages. While the plot occasionally treads familiar ground, it does so with fresh perspectives and creative twists. The visual artistry and soundtrack complement the story perfectly, enhancing the emotional depth of the film. Overall, Inside Out 2 is a touching, insightful, and visually captivating sequel that leaves a lasting impression. What's your favorite part of the Inside Out series?",
                "moviethumb" : "https://i.pinimg.com/564x/1d/5b/1a/1d5b1a0fc4e4a252ed765c73bb323975.jpg",
                "Screenshots" : [
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh4gzAmLbXReePUb56pEO4bdKEWuYJ4GfzJpzcg1ssQpdCQrbxGDHVSMs4INehQYxF_7CckuAJa8upWK_-QqQcqfydEOjK21aTVp9OTCAxixfE5lqERiEqDdxLLL1yJueX9iCeY2w2ZqF1F8MAs_88LEXtHhHAeHk55MhqD9LEOAqXuQy2liFtGuaGrpxrp/s1600/vlcsnap-2024-08-19-12h06m35s346.jpg",
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEitfIAq_Fp3MzDPfWIMWnoEKMg9xg6Wm_af_UPIGHyfQnJ4ecYDF81Y-qt_bNEQKHegZiuYrlrRi6HctOfjqjOUzPpHPyCGLrC-lXhj7iRIDdJS2_CU768K8OW6xkxVv93lUGS_QJW0zoCKg1-2ReLzgGzQN1M6TU7dOOCmC5b6ayVdRdAFbd3zqEA8VGqF/s1600/vlcsnap-2024-08-19-12h06m40s516.jpg",
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjEl5VVb0dJVtPvW7gNBin49SIiw1sTY5u0R6ykujtkkrhp9EmxF7E4W7sjs8CROyXINdbQvCunqcj_hk-1QLzUiobPy5pjzM0aBTnQ_i1ltdT1jfTzsNMeKPm3N7M3rhfeClA4iPwr05NnMWCOmUkus24b8vnz_MBWKh-Alg8R-IfY-anM54yO3c0qkuBc/s1600/vlcsnap-2024-08-19-12h06m53s008.jpg",
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhGxBUBkLe9SdDW5_ucJRmoDTUpL-56KXbL0_A3W5qTwlVw0P_VLlPz6Dprs5MLJAQq3Qq218Y1y7HhUrousc8-QYFSpK72bepgHX-pNDIIHLLdVNH7tIu3m0FG5BH-JKSC82VSJyLA_UcNOJ7iHiOKQugFLnSzj4bz8Wz4mfPbuBIEkfVCb-a2HBpLqz8B/s1600/vlcsnap-2024-08-19-12h07m07s129.jpg",
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhuf4mpX2z8d7h-jK4Bh8tgJvHUGlqTmNHBt2SFgEnHCOmaL453wPeimjYChPOwVvoxGv8EYKAkPQmLWiwFpYIHlzjsdkNMYd2PBsH3hXXQR_5dTsctK5OpJRJdkywDrkGT0d3jDyKz3j4zki3v0VtL9dl5I49gmaGP1gdagPAzJ2th_FpBghliqP3pTuat/s1600/vlcsnap-2024-08-19-12h07m16s018.jpg"
            
                    ],

                "Downloadlinks" : {"480p" : "https://pub-7c3d33710a4c4c8f9e50cb47996f5ea0.r2.dev/Inside.Out.2.2024.HIN.ENG.480p.WEB-DL.x264.Vegamovies.is.mkv",
                "720p" : "https://pub-18f397d85d2b418795d42f93537c3335.r2.dev/Inside.Out.2.2024.720p.HS.WEB-DL.English+Hindi.DDP5.1.H.265.Vegamovies.is.mkv",
            "1080p" : "https://pub-ec9a6bff2f844cd0ad0e2a03b2950bb4.r2.dev/Inside.Out.2.2024.HIN.ENG.1080p.WEB-DL.x264.Vegamovies.is.mkv"}
                
            },
            {
                "moviename":"Evil Dead Rise (2023)",
                 "review" : "Evil Dead Rise  (2023) breathes new life into the horror genre with its chilling narrative and relentless suspense. Set in a high-rise apartment building, the film's claustrophobic setting amplifies the sense of dread, creating a visceral experience for viewers. Director Lee Cronin masterfully crafts a story that blends supernatural terror with real-world fears, pushing the boundaries of psychological horror. The performances are stellar, particularly Alyssa Sutherland, who delivers a haunting portrayal of a mother possessed by malevolent forces. The practical effects and makeup are top-notch, providing gruesome visuals that are both shocking and compelling. The film's pacing is relentless, maintaining a tight grip on the audience's nerves from start to finish. While some scenes may be too intense for the faint-hearted, Evil Dead Rise succeeds in delivering a horror experience that is both terrifying and memorable. It’s a worthy addition to the iconic franchise. What’s your take on it?",
                "moviethumb" : "https://i.pinimg.com/564x/b5/96/9f/b5969f831d59dfff730c57dbaf83dbc2.jpg",
                "Screenshots" : [
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCS0PiGzE51mmZA0ZF7yFwGR6EIIHsSusMms3tfjkjNoEDqFNTmL53BbfpkNQxZSADjSi3uq6afDvh-j-9rS4qXChcYmO-wm8wn39y3FccYILs4W7rB_B4GSECwIIJXOkqxNjvl3PdO9BW-pCXsrHXCogUHIb-URGdoVISEu7F_AuWUmi3cANBX5_1GWee/s1600/vlcsnap-2024-09-20-12h04m38s083.jpg",
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjb-JWEtOthIkjl8Qtfth0QZ26CD8NIv7HCrIZ7VZUchRncl4og5x5VmHC2sSlXAfLEIT4ULdXFznzDusYY-gb6VelMH_KjnbNExsRHkbTBiKHz_-9hwTUmyDH6cFMp0TFkIJXbXc-ngbCyNeROTJ0BQKSOmMX04Akq6km4JXRDfKe8HawuAowGkDm4fBNq/s1600/vlcsnap-2024-09-20-12h04m51s742.jpg",
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhuVQm43jPJMziBrNd4TJKr7-Cxx2Cq-nLM2SWD0pfGsjXGnfz4DqQk9ai-SZ1UGiOGh_mtqAXGBI1lU9Gn4nZC5wb4NJSkyzXZn8Sl8dp9gZTGJ_9GObVA_D0EmVJp-9e2VYDr9G3xW3iDntp8EBgPXkIMbkZw_VaXRo8TnR7e5lt_zchyphenhyphen-pz9LHX8Ia6O/s1600/vlcsnap-2024-09-20-12h05m59s675.jpg",
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg0HeCs5dA41SOQjZo4v0mo880JhS3pLU-Wy1rOpE9psCxyrBsUGGKYSqRnMdeUh3cr2lEFBIMnI0OHmBje6ucLvZfqiDPy5M4usks-VtbPd-U7k39Enc6j0rvniEyZrfw9VI-LbcYUSKB0A-vFdECrtbk9Y9bWd1vdI9U9bqHrAr2cJbjFdNld6I67NdmC/s1600/vlcsnap-2024-09-20-12h08m40s004.jpg",
                   "https://i0.wp.com/blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj1H2GCu9BowG5i9owczM6xTvd_iRzd-Z4bfpj6-79PYIy616rVseF19wH9hCaZ7xMiwQYI_RT6qMqzlWGKI3tP-4Li4UK-jQP-JkNj4PNFYyRRrInBlk-U6pbIHaEl0bsNWOOJVLqOaaTlpJebsI8u5MGP5C4XiQLh-ncDlbY3JcqPp2iIFoeJjxXXmv47/s1600/vlcsnap-2024-09-20-12h12m36s068.jpg"
                    
                    ],

                "Downloadlinks" : {"480p" : "https://f2.fastdl.lol/Evil.Dead.Rise.2023.480p.BluRay.Hindi.English.ESubs.Vegamovies.to.mkv",
                "720p" : "https://f2.fastdl.lol/Evil.Dead.Rise.2023.720p.10bit.BluRay.HIN-ENG.x265.ESub.Vegamovies.is.mkv",
            "1080p" : "https://pub-7797fc51c3e143bdbb9dc2ed208e823e.r2.dev/Evil.Dead.Rise.2023.1080p.BluRay.Hindi.English.ESubs.Vegamovies.to.mkv"}
                
            },
            {
                "moviename":"Deadpool & Wolverine",
                 "review" : "Deadpool & Wolverine is a thrilling crossover that brings together two of Marvel's most iconic and beloved characters in a high-octane, action-packed film. The chemistry between Ryan Reynolds' wise-cracking Deadpool and Hugh Jackman's gruff Wolverine is electric, providing audiences with a perfect blend of humor, grit, and heart. The storyline weaves through intense battles, razor-sharp wit, and moments of surprising emotional depth, keeping viewers on the edge of their seats. The film's direction and special effects are top-notch, with spectacular fight sequences and visually stunning set pieces. The dynamic between the two protagonists allows for both hilarious banter and heartfelt moments, making this a standout film in the superhero genre. While some may find the plot slightly predictable, the film’s charm lies in its character interactions and relentless entertainment value. Deadpool & Wolverine is a must-watch for fans of both characters and action-comedy enthusiasts alike. Have you seen it? What's your take?",
                "moviethumb" : "https://i.pinimg.com/736x/70/95/e8/7095e8f172cc6145da97dc05069a941a.jpg",
                "Screenshots" : [
                   "",""
                    
                    ],

                "Downloadlinks" : {"480p" : "",
                "720p" : "",
            "1080p" : ""}
                
            }

    ]
}